Catalogs/Посетители.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Посетители</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДоступРазрешен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Посетители/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДоступРазрешенПриИзменении(Элементы.ДоступРазрешен);
КонецПроцедуры

&НаКлиенте
Процедура ДоступРазрешенПриИзменении(Элемент)
	Если Объект.ДоступРазрешен Тогда
		Элемент.ЦветТекстаЗаголовка = WebЦвета.Зеленый;
	Иначе
		Элемент.ЦветТекстаЗаголовка = WebЦвета.Красный;
	КонецЕсли;
	Элемент.Заголовок = ?(Объект.ДоступРазрешен,"Доступ разрешен","Доступ запрещен");
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьФото(Команда)
	
	Если Параметры.Ключ.Пустая() Тогда
		ВызватьИсключение("Необходимо сначала записать элемент !!!");
	КонецЕсли;
	
	ПараметрыДиалога = Новый Структура;
	ПараметрыДиалога.Вставить("Заголовок", НСтр("ru = 'Выберите файл с фото'"));
	ПараметрыДиалога.Вставить("Фильтр", НСтр("ru='все файлы (*.*)|*.*'"));
	ПараметрыДиалога.Вставить("Режим", РежимДиалогаВыбораФайла.Открытие);
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьФайлЗавершение", ЭтотОбъект, "external_" + СокрЛП(Объект.Код));
	ОбменДаннымиКлиент.ВыбратьИПередатьФайлНаСервер(Оповещение, ПараметрыДиалога, УникальныйИдентификатор)
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайлЗавершение(РезультатПомещенияФайлов, ИмяВСсылке) Экспорт
	
	Адрес = РезультатПомещенияФайлов.Хранение;
	ТекстОшибки = РезультатПомещенияФайлов.ОписаниеОшибки;
	ИмяВыбранногоФайла = РезультатПомещенияФайлов.Имя;
	
	Если ПустаяСтрока(ТекстОшибки) И ПустаяСтрока(Адрес) Тогда
		ТекстОшибки = НСтр("ru = ‘Ошибка передачи файла на сервер’");
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ВыбранныйФайл = Новый Файл(ИмяВыбранногоФайла);
	РасширениеФайла = СтрЗаменить(ВыбранныйФайл.Расширение,".","");
	
	Объект.Фото = ОбработатьФайлНаСервере(Адрес,РасширениеФайла,ИмяВСсылке)
КонецПроцедуры

&НаСервере
Функция ОбработатьФайлНаСервере(Адрес, РасширениеФайла, ИмяВСсылке)
	
	// Получение данных из временного хранилища
	Данные = ПолучитьИзВременногоХранилища(Адрес);
	// Получение имени временного файла
	ФайлФото = ПолучитьИмяВременногоФайла(РасширениеФайла);
	// Сохранение данных во временный файл
	Данные.Записать(ФайлФото);
	
	ФайлЛога = "C:\Users\g1Csrv$\AppData\Local\Temp\LogFile_S3.txt";
	
	// Обработка файла…
	ИмяБакета		= "photosvisitors";
	КлючДоступа		= "AKIA5IASEGZYFNOJFZJG";
	СекретныйКлюч	= "uZPLq17LTiyb9KnBgt8xluGwIkBAeb4vYrHj+Oz9";
	ИмяЗаписи		= ИмяВСсылке;
	ПутьКФайлу		= ФайлФото;
	ТипКонтента		= "image/" + РасширениеФайла;
	ЗаписьЛога		= " -ErrorVariable err -InformationVariable info -WarningVariable warn; ($err.ErrorRecord, $warn, $info) | Out-File " + ФайлЛога;
	
	ТекстКоманды = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	"C:\Program Files\PowerShell\7\pwsh.exe -Command ""& {Write-S3Object -BucketName %1 -Region us-east-1 -AccessKey %2 -SecretKey %3 -Key %4 -File %5 -CannedACLName public-read -PublicReadOnly -ContentType %6%7}""", 
	ИмяБакета,
	КлючДоступа,
	СекретныйКлюч,
	ИмяЗаписи,
	ПутьКФайлу,
	ТипКонтента,
	ЗаписьЛога);
	
	КодВозврата = Неопределено;
	
	Попытка
		ЗапуститьПриложение(ТекстКоманды,,Истина,КодВозврата);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
	// Хорошим тоном будет удалить временный файл
	УдалитьФайлы(ФайлФото);
	
	ТекстДок = Новый ТекстовыйДокумент;
	Файл = Новый Файл(ФайлЛога);
	Если Файл.Существует() Тогда
		ТекстДок.Прочитать(ФайлЛога,КодировкаТекста.UTF8);
		ТекстЛога = ТекстДок.ПолучитьТекст();
		УдалитьФайлы(ФайлЛога);
	Иначе
		ТекстЛога = "";
	КонецЕсли;
	Если НЕ ПустаяСтрока(ТекстЛога) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка: " + ТекстЛога);
		ВызватьИсключение(ТекстЛога);
	КонецЕсли;
	
	Ответ = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	"https://%1.s3.amazonaws.com/%2",
	ИмяБакета,
	ИмяЗаписи);
	
	Возврат Ответ;
	
КонецФункции

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(Объект.Наименование) Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	Посетители.Код КАК Код,
		|	Посетители.Ссылка КАК Посетитель
		|ИЗ
		|	Справочник.Посетители КАК Посетители
		|ГДЕ
		|	Посетители.Наименование = &Наименование
		|	И Посетители.Ссылка <> &Ссылка";
		
		Запрос.УстановитьПараметр("Наименование", Объект.Наименование);
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда 
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			
			ОбщегоНазначения.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Наименование ""%1"" уже закреплен за ""%2""'; uk = 'Найменування ""%1"" вже закріплений за ""%2""'"),
			Выборка.Посетитель,
			Выборка.Код),Объект.Ссылка, "Наименование", "Объект.Наименование", Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Телефон) Тогда                       
		
		Если Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Объект.Телефон) И Объект.ДоступРазрешен Тогда 
			ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Телефон должен состоять только из цифр'; uk = 'Телефон повинен складатися тільки із цифр'"),
			Объект.Ссылка, 
			"Телефон", 
			"Объект.Телефон", 
			Отказ);	
		КонецЕсли;
		
		Если Не Отказ Тогда 
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	Посетители.Ссылка КАК Посетитель
			|ИЗ
			|	Справочник.Посетители КАК Посетители
			|ГДЕ
			|	Посетители.Телефон = &Телефон
			|	И Посетители.Ссылка <> &Ссылка";
			
			Запрос.УстановитьПараметр("Телефон", Объект.Телефон);
			Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
			
			Результат = Запрос.Выполнить();
			
			Если Не Результат.Пустой() Тогда 
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				
				ОбщегоНазначения.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Телефон ""%1"" уже закреплен за ""%2""'; uk = 'Телефон ""%1"" вже закріплений за ""%2""'"),
				Объект.Телефон,
				Выборка.Посетитель),
				Объект.Ссылка, 
				"Телефон", 
				"Объект.Телефон", 
				Отказ);		
			КонецЕсли;			
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры
